data_assignment/foam_cases/base_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Side
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          39588;
        startFace       39229;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          300;
        startFace       78817;
    }
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          135;
        startFace       79117;
    }
    Flap
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          107;
        startFace       79252;
    }
    Airfoil
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          176;
        startFace       79359;
    }
)

// ************************************************************************* //
